In [1]:
import numpy as np
import pandas as pd

from sklearn.metrics.pairwise import cosine_similarity

In [2]:
data = {
    'user':['user 1','user 2','user 1','user 2'],
    'movie':['movie 1','movie 2','movie 2','movie 1'],
    'rating':[5,3,4,2]
}

In [3]:
df = pd.DataFrame(data)

In [4]:
df

     user    movie  rating
0  user 1  movie 1       5
1  user 2  movie 2       3
2  user 1  movie 2       4
3  user 2  movie 1       2

In [9]:
pt = df.pivot_table(index='user',columns='movie',values='rating')

In [10]:
pt_user = df.pivot_table(index='movie',columns='user',values='rating')

In [12]:
pt_user

user     user 1  user 2
movie
movie 1       5       2
movie 2       4       3

In [13]:
pt

movie   movie 1  movie 2
user
user 1        5        4
user 2        2        3

In [30]:
pt.fillna(0,inplace=True)

In [31]:
pt

movie   movie 1  movie 2
user
user 1        5        4
user 2        2        3

In [34]:
similarity = cosine_similarity(pt)

In [35]:
similarity

array([[1.        , 0.95292578],
       [0.95292578, 1.        ]])

In [ ]:
pt